------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\DEE\Dissertation\Quantitative approaches\DATA\mylog.log
  log type:  text
 opened on:  13 Aug 2024, 08:23:21

. tab Country

    Country |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        425       45.02       45.02
          2 |        519       54.98      100.00
------------+-----------------------------------
      Total |        944      100.00

. tab Studysite

  Studysite |      Freq.     Percent        Cum.
------------+-----------------------------------
         11 |        222       23.52       23.52
         12 |        202       21.40       44.92
         21 |        230       24.36       69.28
         22 |        290       30.72      100.00
------------+-----------------------------------
      Total |        944      100.00

. tab Country Studysite B_HH_type
too many variables specified
r(103);

. tab Country Studysite

           |                  Studysite
   Country |        11         12         21         22 |     Total
-----------+--------------------------------------------+----------
         1 |       222        202          0          1 |       425 
         2 |         0          0        230        289 |       519 
-----------+--------------------------------------------+----------
     Total |       222        202        230        290 |       944 


. tab Studysite B_m1_gender

           |      B_m1_gender
 Studysite |         1          2 |     Total
-----------+----------------------+----------
        11 |       214          8 |       222 
        12 |       153         49 |       202 
        21 |       181         49 |       230 
        22 |       278         12 |       290 
-----------+----------------------+----------
     Total |       826        118 |       944 


. tab Studysite B_HH_type

           |       B_HH_type
 Studysite |         1          3 |     Total
-----------+----------------------+----------
        11 |       214          7 |       221 
        12 |       176         26 |       202 
        21 |       182         48 |       230 
        22 |       280         10 |       290 
-----------+----------------------+----------
     Total |       852         91 |       943 


. save "D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta", replace
file D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta saved

. save "D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta", replace
file D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta saved

. save "D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta", append
option append not allowed
r(198);

. log using mylog.log
log file already open
r(604);

. tab Studysite B_m1_home_occup

           |         B_m1_home_occup
 Studysite |         1          2          3 |     Total
-----------+---------------------------------+----------
        11 |       222          0          0 |       222 
        12 |       174          6         22 |       202 
        21 |       222          4          4 |       230 
        22 |       244         19         27 |       290 
-----------+---------------------------------+----------
     Total |       862         29         53 |       944 


. save "D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta", append
option append not allowed
r(198);

. save "D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta", replace
file D:\DEE\Dissertation\Quantitative approaches\DATA\DTJune_15_2023.dta saved

. exit, clear
------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\DEE\Dissertation\Quantitative approaches\DATA\mylog.log
  log type:  text
 opened on:  15 Aug 2024, 12:07:55

. log close
      name:  <unnamed>
       log:  D:\DEE\Dissertation\Quantitative approaches\DATA\mylog.log
  log type:  text
 closed on:  15 Aug 2024, 12:08:39
------------------------------------------------------------------------------------------------------
